In [1]:
import pandas as pd

import sqlite3

In [8]:
# you need to write the query to make it work
with sqlite3.connect("./people_database.db") as c:
    result = pd.read_sql(
        """
           SELECT (p.first_name || " " || p.last_name)
             FROM people as p
        """,
        c
    )
result

        (p.first_name || " " || p.last_name)
0                                 Eloy Sykes
1                                 Dusti Tate
2                                Marcus Todd
3                             Yvone Mcdaniel
4                              Augustus Bean
...                                      ...
9999995                       Michal Swanson
9999996                          Cassy Watts
9999997                           Pa Mercado
9999998                     Grayce Patterson
9999999                       Lane Frederick

[10000000 rows x 1 columns]